export const uiTextsRu = {
  defaultName1: 'Игрок 1',
  defaultName2: 'Игрок 2',
  enterYourName: 'Введите Ваше имя',
  createGame: 'Создать игру',
  enterAccessCode: 'Введите код доступа',
  enterGame: 'Войти в игру',
  sendCode: 'Скопируйте и отправьте этот код для входа своему оппоненту',
  ready: 'Готово!',
  tip: `
  Расставьте все свои корабли, кликая по полю.
  Корабли могут быть любой формы и могут соприкасаться только углами.
  `,
  validShips: 'Ваши корабли расставлены по правилам',
  startGame: 'Начать игру',
  waitForAnotherPlayer: 'Ваши корабли готовы. Ждем игрока, который еще не расставил свои корабли',
  anotherPlayerIsWaiting: 'Другой игрок уже расставил корабли и готов начать. Не заставляйте его слишком долго ждать:)',
  yourTurn: 'Ваш ход. Стреляйте, кликая по полю оппонента',
  opponentTurn: 'Ждем выстрела оппонента',
  endGame: 'Игра завершена! Победитель: ',
  congrats: 'Поздравляем!!!',
  goBack: 'Назад',
}

export const errorMessagesRu = {
  connectionLost: 'Нет связи с сервером. Попробуйте его запустить ;D Инструкция здесь',
  gameFull: 'В этой игре уже есть два игрока. Уточните код у своего оппонента и попробуйте еще раз',
  wrongCodeOrNoGame: 'Не удалось найти игру с таким кодом. Уточните код у своего оппонента и попробуйте еще раз',
  defaultError: 'Что-то пошло не так, но мы уже работаем над этим. Попробуйте обновить страницу и начать снова',
}