export const uiTextsRu = {
  connectionLost: 'Потеряна связь с сервером :(',
  enterYourName: 'Введите Ваше имя',
  createGame: 'Создать игру',
  enterAccessCode: 'Введите код доступа',
  enterGame: 'Войти в игру',
  sendCode: 'Скопируйте и отправьте этот код для входа своему оппоненту',
  ready: 'Готово!',
  tip: `
  Расставьте все свои корабли, кликая по полю.
  Корабли могут быть любой формы и могут соприкасаться только углами.
  `,
  validShips: 'Ваши корабли расставлены по правилам',
  startGame: 'Начать игру',
  waitForAnotherPlayer: 'Ваши корабли готовы. Ждем игрока, который еще не расставил свои корабли',
  anotherPlayerIsWaiting: 'Другой игрок уже расставил корабли и готов начать. Не заставляйте его слишком долго ждать:)',
  yourTurn: 'Ваш ход. Стреляйте, кликая по полю оппонента',
  opponentTurn: 'Ждем выстрела оппонента',
}