export const uiTextsRu = {
  gameHeading: 'Морской бой',
  createGameHeading: 'Создать новую игру',
  joinGameHeading: 'Присоединиться к игре',
  defaultName1: 'Игрок 1',
  defaultName2: 'Игрок 2',
  enterYourName: 'Введите Ваше имя',
  createGame: 'Создать игру',
  enterAccessCode: 'Введите код доступа',
  enterGame: 'Войти в игру',
  sendCode: 'Скопируйте и отправьте своему оппоненту этот код для входа',
  ready: 'Готово!',
  tip: `
  Расставьте все свои корабли, кликая по полю.
  Корабли могут быть любой формы и могут соприкасаться только углами
  `,
  validShips: 'Ваши корабли расставлены по правилам',
  startGame: 'Начать игру',
  waitForAnotherPlayer: `
  Ваши корабли готовы.
  Ждем игрока, который еще не расставил свои корабли
  `,
  anotherPlayerIsWaiting: 'Другой игрок только что расставил корабли и готов начать. Не заставляйте его слишком долго ждать:)',
  myShips: 'Мои корабли',
  opponentShips: 'Корабли оппонента',
  yourTurn: 'Ваш ход. Стреляйте, кликая по полю оппонента',
  opponentTurn: 'Ждем выстрела оппонента',
  endGame: `
  Вы не успели подбить все корабли оппонента:(
  Победитель - `,
  congrats: 'Игра завершилась Вашей победой! Поздравляем!!!',
  switchToDark: 'Темная тема',
  switchToLight: 'Светлая тема',
}

export const errorMessagesRu = {
  connectionLost: `
  Нет связи с сервером.
  Попробуйте его запустить ;D
  Инструкция здесь
  `,
  gameFull: 'В этой игре уже есть два игрока. Уточните код у своего оппонента и попробуйте еще раз',
  wrongCodeOrNoGame: 'Не удалось найти игру с таким кодом. Уточните код у своего оппонента и попробуйте еще раз',
  anotherPlayerDisconnected: 'Пропала связь с другим игроком, игра не может продолжаться( Обновите страницу, чтобы начать снова',
  defaultError: 'Что-то пошло не так, но мы уже работаем над этим. Попробуйте обновить страницу и начать снова',
}